package com.example.fitness.trainings

object WorkoutRepository {

    val workouts_abs = arrayListOf<Workout>(
        Workout(0,"Скручивания лёжа","3х10"),
        Workout(1,"Ножницы","3х10"),
        Workout(2,"Косые скручивания","3х10"),
        Workout(3,"Подъемы прямых ног лежа","3х10"),
        Workout(4,"Комбинированные скручивания","3х10"),
        Workout(5,"Книжка","3х10"),
        Workout(6,"Велосипед","3х10"),
        Workout(7,"Русский твист","3х10"),
        Workout(8,"Планка","1 минута"),
    )

    val workouts_complexMan = arrayListOf<Workout>(
        Workout(0,"Отжимания от пола","3х20"),
        Workout(1,"Мертвый жук","3х20"),
        Workout(2,"Бёрпи","3х10"),
        Workout(3,"Скручивания","3х20"),
        Workout(4,"Обратные отжимания","3х20"),
        Workout(5,"Приседания","3х20"),
        Workout(6,"Выпады на каждую ногу","3х20"),
        Workout(7,"Выпрыгивания","3х20"),
        Workout(8,"Бёрпи","3х20"),
        Workout(9,"Планка","1 минута"),
    )

    val workouts_upperMan = arrayListOf<Workout>(
        Workout(0,"Классические отжимания","3х20"),
        Workout(1,"Отжимания широким хватом","3х20"),
        Workout(2,"Отжимания узким хватом","3х20"),
        Workout(3,"Обратные отжимания","3х20"),
        Workout(4,"Подтягивания","3х15"),
        Workout(5,"Классические отжимания","3х20"),
        Workout(6,"Отжимания широким хватом","3х20"),
        Workout(7,"Отжимания узким хватом","3х20"),
        Workout(8,"Обратные отжимания","3х20"),
        Workout(9,"Подтягивания","3х15"),
        Workout(10,"Планка","1 минута"),
    )

    val workouts_leggsWoman = arrayListOf<Workout>(
        Workout(0,"Приседания с подъёмом на носки","3х20"),
        Workout(1,"Приседания с боковыми выпадами","3х20"),
        Workout(2,"Пульсирующие выпады на каждую ногу","3х15"),
        Workout(3,"Выпады назад","3х20"),
        Workout(4,"Выпады вперёд","3х20"),
        Workout(5,"Махи ногой в сторону","3х20"),
        Workout(6,"Подъёмы ног в мостике","much"),
        Workout(7,"Разведение ног в мостике","3х20"),
        Workout(8,"Планка","1 минута"),
    )


}