package com.example.fitness.trainings

object WorkoutRepository {

    val workouts_abs = arrayListOf<Workout>(
        Workout(0,"скручивания лёжа","3х10"),
        Workout(1,"ножницы","3х10"),
        Workout(2,"косые скручивания","3х10"),
        Workout(3,"Подъемы прямых ног лежа","3х10"),
        Workout(4,"Комбинированные скручивания","3х10"),
        Workout(5,"Книжка","3х10"),
        Workout(6,"Велосипед","3х10"),
        Workout(7,"русский твист","3х10"),
        Workout(8,"планка","1 минута"),
    )

    val workouts_complexMan = arrayListOf<Workout>(
        Workout(0,"отжимания от пола","3х20"),
        Workout(1,"мертвый жук","3х20"),
        Workout(2,"бёрпи","3х10"),
        Workout(3,"скручивания","3х20"),
        Workout(4,"обратные отжимания","3х20"),
        Workout(5,"приседания","3х20"),
        Workout(6,"выпады на каждую ногу","3х20"),
        Workout(7,"выпрыгивания","3х20"),
        Workout(8,"бёрпи","3х20"),
        Workout(9,"планка","1 минута"),
    )

    val workouts_upperMan = arrayListOf<Workout>(
        Workout(0,"классические отжимания","3х20"),
        Workout(1,"отжимания широким хватом","3х20"),
        Workout(2,"отжимания узким хватом","3х20"),
        Workout(3,"обратные отжимания","3х20"),
        Workout(4,"подтягивания","3х15"),
        Workout(5,"классические отжимания","3х20"),
        Workout(6,"отжимания широким хватом","3х20"),
        Workout(7,"отжимания узким хватом","3х20"),
        Workout(8,"обратные отжимания","3х20"),
        Workout(9,"подтягивания","3х15"),
        Workout(10,"планка","1 минута"),
    )

    val workouts_leggsWoman = arrayListOf<Workout>(
        Workout(0,"приседания с подъёмом на носки","3х20"),
        Workout(1,"приседания с боковыми выпадами","3х20"),
        Workout(2,"пульсирующие выпады на каждую ногу","3х15"),
        Workout(3,"выпады назад","3х20"),
        Workout(4,"выпады вперёд","3х20"),
        Workout(5,"махи ногой в сторону","3х20"),
        Workout(6,"подъёмы ног в мостике","much"),
        Workout(7,"разведение ног в мостике","3х20"),
        Workout(8,"планка","1 минута"),
    )


}